package com.risk.enums;

public enum DecisionStatus {

    /*Рішення створюється або редагується, але ще не готове до розрахунку.*/
    DRAFT,

    /*Рішення готове до відправки на обчислення.
     Використовується Decision Service перед викликом Calculation Service.*/
    READY_FOR_CALCULATION,

    /*Запит надіслано до Calculation Service, і обчислення триває.*/
    CALCULATING,

    /*Обчислення успішно завершено, результати збережено.Рішення готове до перегляду та фіналізації.*/
    CALCULATED,

    /*Рішення було переглянуто, затверджено і прийнято.Дані є остаточними й не можуть бути змінені (зазвичай).*/
    FINALIZED,

    /*Обчислення в Calculation Service не вдалося через внутрішню помилку або невалідні вхідні дані.*/
    CALCULATION_FAILED
}
